; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v12 ?v3)
             (pred_7 ?v8 ?v6)
             (pred_12 ?v12 ?v6)
             (pred_6 ?v13 ?v12 )
	     (pred_2 ?v12)
             (pred_9 ?v5)
             (pred_10 ?v8)
             (pred_4 ?v6)
             (pred_8 ?v12)
             (pred_3 ?v8)
             (pred_1 ?v12)
             (pred_11 ))



(:action op_4
:parameters (?v2 ?v1 ?v9 ?v7)
:precondition (and (pred_9 ?v2) (pred_9 ?v1) (pred_10 ?v9) (pred_4 ?v7)
          (pred_5 ?v2 ?v1) (pred_7 ?v9 ?v7)
                   (pred_12 ?v1 ?v7) (pred_2 ?v2) 
                   (pred_8 ?v1) (pred_3 ?v9))
:effect (and  (pred_1 ?v1) (not (pred_8 ?v1))))


(:action op_2
:parameters (?v2 ?v11)
:precondition (and (pred_9 ?v2) (pred_9 ?v11)
               (pred_2 ?v2) (pred_5 ?v2 ?v11) (pred_1 ?v11))
:effect (and (pred_2 ?v11) (not (pred_2 ?v2))))

(:action op_5
:parameters (?v2 ?v9)
:precondition (and (pred_9 ?v2) (pred_10 ?v9) 
                  (pred_2 ?v2) (pred_6 ?v9 ?v2) (pred_11 ))
:effect (and (pred_3 ?v9)
   (not (pred_6 ?v9 ?v2)) (not (pred_11 ))))


(:action op_1
:parameters (?v2 ?v4 ?v10)
:precondition (and (pred_9 ?v2) (pred_10 ?v4) (pred_10 ?v10)
                  (pred_2 ?v2) (pred_3 ?v10) (pred_6 ?v4 ?v2))
:effect (and (pred_3 ?v4) (pred_6 ?v10 ?v2)
        (not (pred_3 ?v10)) (not (pred_6 ?v4 ?v2))))

(:action op_3
:parameters (?v2 ?v9)
:precondition (and (pred_9 ?v2) (pred_10 ?v9) 
                  (pred_2 ?v2) (pred_3 ?v9))
:effect (and (pred_11 ) (pred_6 ?v9 ?v2) (not (pred_3 ?v9)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_11 obj_16 obj_26 obj_28 obj_08 obj_15 obj_18 obj_10 obj_07 obj_29 obj_03 obj_09 obj_27 obj_21 obj_25 obj_22 obj_30 obj_04 obj_14 obj_05 obj_02 obj_13 obj_20 obj_17 obj_01
    obj_06 obj_23
    obj_12 obj_19 obj_24
    )

    (:init
       (pred_11)

       (pred_9 obj_11)
       (pred_9 obj_16)
       (pred_9 obj_26)
       (pred_9 obj_28)
       (pred_9 obj_08)
       (pred_9 obj_15)
       (pred_9 obj_18)
       (pred_9 obj_10)
       (pred_9 obj_07)
       (pred_9 obj_29)
       (pred_9 obj_03)
       (pred_9 obj_09)
       (pred_9 obj_27)
       (pred_9 obj_21)
       (pred_9 obj_25)
       (pred_9 obj_22)
       (pred_9 obj_30)
       (pred_9 obj_04)
       (pred_9 obj_14)
       (pred_9 obj_05)
       (pred_9 obj_02)
       (pred_9 obj_13)
       (pred_9 obj_20)
       (pred_9 obj_17)
       (pred_9 obj_01)
       (pred_4 obj_06)
       (pred_4 obj_23)
       (pred_10 obj_12)
       (pred_10 obj_19)
       (pred_10 obj_24)

       (pred_5 obj_11 obj_15)
       (pred_5 obj_11 obj_16)
       (pred_5 obj_16 obj_18)
       (pred_5 obj_16 obj_26)
       (pred_5 obj_16 obj_11)
       (pred_5 obj_26 obj_10)
       (pred_5 obj_26 obj_28)
       (pred_5 obj_26 obj_16)
       (pred_5 obj_28 obj_07)
       (pred_5 obj_28 obj_08)
       (pred_5 obj_28 obj_26)
       (pred_5 obj_08 obj_29)
       (pred_5 obj_08 obj_28)
       (pred_5 obj_15 obj_03)
       (pred_5 obj_15 obj_18)
       (pred_5 obj_15 obj_11)
       (pred_5 obj_18 obj_09)
       (pred_5 obj_18 obj_10)
       (pred_5 obj_18 obj_16)
       (pred_5 obj_18 obj_15)
       (pred_5 obj_10 obj_27)
       (pred_5 obj_10 obj_07)
       (pred_5 obj_10 obj_26)
       (pred_5 obj_10 obj_18)
       (pred_5 obj_07 obj_21)
       (pred_5 obj_07 obj_29)
       (pred_5 obj_07 obj_28)
       (pred_5 obj_07 obj_10)
       (pred_5 obj_29 obj_25)
       (pred_5 obj_29 obj_08)
       (pred_5 obj_29 obj_07)
       (pred_5 obj_03 obj_22)
       (pred_5 obj_03 obj_09)
       (pred_5 obj_03 obj_15)
       (pred_5 obj_09 obj_30)
       (pred_5 obj_09 obj_27)
       (pred_5 obj_09 obj_18)
       (pred_5 obj_09 obj_03)
       (pred_5 obj_27 obj_04)
       (pred_5 obj_27 obj_21)
       (pred_5 obj_27 obj_10)
       (pred_5 obj_27 obj_09)
       (pred_5 obj_21 obj_14)
       (pred_5 obj_21 obj_25)
       (pred_5 obj_21 obj_07)
       (pred_5 obj_21 obj_27)
       (pred_5 obj_25 obj_05)
       (pred_5 obj_25 obj_29)
       (pred_5 obj_25 obj_21)
       (pred_5 obj_22 obj_02)
       (pred_5 obj_22 obj_30)
       (pred_5 obj_22 obj_03)
       (pred_5 obj_30 obj_13)
       (pred_5 obj_30 obj_04)
       (pred_5 obj_30 obj_09)
       (pred_5 obj_30 obj_22)
       (pred_5 obj_04 obj_20)
       (pred_5 obj_04 obj_14)
       (pred_5 obj_04 obj_27)
       (pred_5 obj_04 obj_30)
       (pred_5 obj_14 obj_17)
       (pred_5 obj_14 obj_05)
       (pred_5 obj_14 obj_21)
       (pred_5 obj_14 obj_04)
       (pred_5 obj_05 obj_01)
       (pred_5 obj_05 obj_25)
       (pred_5 obj_05 obj_14)
       (pred_5 obj_02 obj_13)
       (pred_5 obj_02 obj_22)
       (pred_5 obj_13 obj_20)
       (pred_5 obj_13 obj_30)
       (pred_5 obj_13 obj_02)
       (pred_5 obj_20 obj_17)
       (pred_5 obj_20 obj_04)
       (pred_5 obj_20 obj_13)
       (pred_5 obj_17 obj_01)
       (pred_5 obj_17 obj_14)
       (pred_5 obj_17 obj_20)
       (pred_5 obj_01 obj_05)
       (pred_5 obj_01 obj_17)
       (pred_8 obj_11)
       (pred_8 obj_30)
       (pred_8 obj_02)
       (pred_12  obj_11 obj_06)
       (pred_12  obj_30 obj_23)
       (pred_12  obj_02 obj_23)
       (pred_1 obj_16)
       (pred_1 obj_26)
       (pred_1 obj_28)
       (pred_1 obj_08)
       (pred_1 obj_15)
       (pred_1 obj_18)
       (pred_1 obj_10)
       (pred_1 obj_07)
       (pred_1 obj_29)
       (pred_1 obj_03)
       (pred_1 obj_09)
       (pred_1 obj_27)
       (pred_1 obj_21)
       (pred_1 obj_25)
       (pred_1 obj_22)
       (pred_1 obj_04)
       (pred_1 obj_14)
       (pred_1 obj_05)
       (pred_1 obj_13)
       (pred_1 obj_20)
       (pred_1 obj_17)
       (pred_1 obj_01)

       (pred_7  obj_12 obj_06)
       (pred_7  obj_19 obj_23)
       (pred_7  obj_24 obj_06)
       (pred_6 obj_12 obj_17)
       (pred_6 obj_19 obj_16)
       (pred_6 obj_24 obj_07)
       (pred_2 obj_04)
    )

    (:goal (and
       (pred_6 obj_24 obj_27)
    ))
(:constraints
  (always (not (pred_2 obj_10)))
)
)

; plan
1. (op_2 obj_04 obj_27)
   deleted: (pred_2 obj_04)
   added: (pred_2 obj_27)
   goals met: 0 of 1
2. (op_2 obj_27 obj_21)
   deleted: (pred_2 obj_27)
   added: (pred_2 obj_21)
   goals met: 0 of 1
3. (op_2 obj_21 obj_07)
   deleted: (pred_2 obj_21)
   added: (pred_2 obj_07)
   goals met: 0 of 1
4. (op_5 obj_07 obj_24)
   deleted: (pred_6 obj_24 obj_07) (pred_11)
   added: (pred_3 obj_24)
   goals met: 0 of 1
5. (op_2 obj_07 obj_21)
   deleted: (pred_2 obj_07)
   added: (pred_2 obj_21)
   goals met: 0 of 1
6. (op_2 obj_21 obj_27)
   deleted: (pred_2 obj_21)
   added: (pred_2 obj_27)
   goals met: 0 of 1
7. (op_3 obj_27 obj_24)
   deleted: (pred_3 obj_24)
   added: (pred_11) (pred_6 obj_24 obj_27)
   goals met: 1 of 1
